#include <libssh2.h> // Библиотека для SSH
#include <arpa/inet.h> // Превратить IP адрес в машинный язык
#include <netinet/in.h> // Адрес и порт хранить в структуре "sockaddr_in"
#include <sys/socket.h> // Создать сокет (TCP протокол) и подключится к маршрутизатору
#include <unistd.h> // Что бы закрыть сокет

#include <iostream> // Выводить текст на экран
#include <string> // Хранить IP, логи, пароли как строки

int main() {
    // Параметры роутера
    // host, user, pass - это переменные, в ковычках значения 
    std::string host = "";
    std::string user = "";
    std::string pass = "";

    // 1. Инициализация libssh2 - запуск библиоеки SSH
    libssh2_init(0);

    // 2. Создать TCP-сокет
    int sock = socket(AF_INET, SOCK_STREAM, 0); // Создаем новый поток, где AF_INET - тип адреса IPv4; SOCK_STREM - Тип соединения TCP, 0 - автовыбор по первым агрументам
    if (sock < 0) { // Меньше 0 ошибка, больше или равно нолю успех
        std::cerr << "Ошибка: socket()\n"; // std::cerr выводит ошибку с ошибкой в консоль 
        return 1; // Завершить с кодом 1 - ошибка
    }

    // 3. Подключиться к роутеру
    sockaddr_in sin{}; // Стуктура данных для хранения информации о хосте 
    sin.sin_family = AF_INET; // IPV4 
    sin.sin_port = htons(22); // Порт

    if (inet_pton(AF_INET, host.c_str(), &sin.sin_addr) != 1) { // Если не удалось перевести строку ip адресс из текста в число в формате сети... то вернется значение отличное от единички
        std::cerr << "Ошибка: inet_pton()\n"; // std::cerr выводим сообщение об ошибки
        return 1; // Выходим с кодом 1 - Ошибка
    }

    if (::connect(sock, (sockaddr*)&sin, sizeof(sin)) != 0) { // Соединяемся через указаный ранее соккет со структурой_sin_с размерностью структуры_size_of_sun_в байтах... если соединение прошло успешно возвращается 0.....если нет тогда выйти с сообщением об ошибке        
        std::cerr << "Ошибка: connect()\n"; // std::cerr - стандартная библиотека вывода ошибок 
        return 1; // Выход с кодом 1 - Невозможно соединятся
    }

    std::cout << "TCP подключено к " << host << "\n"; // std::cout - стандарной функции ввода/выода

